wef/02-heartbeat.xml

<s:Envelope
    xmlns:s="http://www.w3.org/2003/05/soap-envelope"
    xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:e="http://schemas.xmlsoap.org/ws/2004/08/eventing"
    xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
    xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd">
  <s:Header>
    <a:To>https://10.0.2.2:15986/wsman/subscriptions/36BEB691-AFE1-458F-A6B4-8B60037F9BEE/1</a:To>
    <m:MachineID xmlns:m="http://schemas.microsoft.com/wbem/wsman/1/machineid" s:mustUnderstand="false">dc.markkurossi.com</m:MachineID>
    <a:ReplyTo>
      <a:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
    </a:ReplyTo>
    <a:Action s:mustUnderstand="true">http://schemas.dmtf.org/wbem/wsman/1/wsman/Heartbeat</a:Action>
    <w:MaxEnvelopeSize s:mustUnderstand="true">512000</w:MaxEnvelopeSize>
    <a:MessageID>uuid:8C432465-F3C1-4264-ABC9-4FCAC4310173</a:MessageID>
    <w:Locale xml:lang="en-US" s:mustUnderstand="false" />
    <p:DataLocale xml:lang="en-US" s:mustUnderstand="false" />
    <p:SessionId s:mustUnderstand="false">uuid:33AE3D43-87F0-44BB-95DB-A61C383EF2EC</p:SessionId>
    <p:OperationID s:mustUnderstand="false">uuid:E84098D3-1AE6-4F38-AB27-0A35F902BAC3</p:OperationID>
    <p:SequenceId s:mustUnderstand="false">1</p:SequenceId>
    <w:OperationTimeout>PT60.000S</w:OperationTimeout>
    <e:Identifier xmlns:e="http://schemas.xmlsoap.org/ws/2004/08/eventing">794B572A-0F96-46A6-8EFF-0F81EE927A05</e:Identifier>
    <w:AckRequested/>
  </s:Header>
  <s:Body>
    <w:Events>
    </w:Events>
  </s:Body>
</s:Envelope>
